Revit 2027 API
KeynoteFailures Properties
The BuiltInFailures.KeynoteFailures type exposes the following members.
Properties
Name | Description
MissKeynoteParameter |  No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.
MissKeynotingSystem |  No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family.
NotAssociatedKeynoteParameter |  Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system.
Top
See Also
Reference
BuiltInFailures.KeynoteFailures Class
Autodesk.Revit.DB Namespace